
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |    Add |   🟡 Change |    Destroy |
|----------:|-------:|------------:|-----------:|
|        ✅ |      0 |           2 |          0 |
## Affected resources by action

|  Action  | Resources                                              |
|:--------:|:-------------------------------------------------------|
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix` |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`       |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id = "lt-0e5d85805b1236e19"
                  + version            = "16"
                }
              + override (known after apply)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAyLCAiZGVzdHJveSI6IDB9fQ==
```
</details>